package com.wildhuck.cumchatka

object Source {
    fun getDays() = listOf(
        Day(
            "1927",
            listOf(
                News(
                    "Украли самокат",
                    "Много самокатов",
                    "30.08.2222"
                ),
                News(
                    "Украли самокат",
                    "Много саааааааамокатов ааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааааа",
                    "30.08.2222"
                ),
                News(
                    "Украли самокат",
                    "Много самокатов",
                    "30.08.2222"
                )
            )
        ),
        Day(
            "1929",
            listOf(
                News(
                    "Украли самокат",
                    "Много самокатов",
                    "30.08.2222"
                )
            )
        ),
        Day(
            "1927",
            listOf(
                News(
                    "Украли самокат",
                    "Много самокатов",
                    "30.08.2222"
                )
            )
        ),
        Day(
            "1927",
            listOf(
                News(
                    "Украли самокат",
                    "Много самокатов",
                    "30.08.2222"
                )
            )
        ),
        Day(
            "1927",
            listOf(
                News(
                    "Украли самокат",
                    "Много самокатов",
                    "30.08.2222"
                )
            )
        ),
    )
}