package com.wildhuck.cumchatka

object Source {
    fun getDays() = listOf(
        Day(
            "1952",
            listOf(
                Event(
                    "Землетрясение и цунами 1952 года",
                    "Землетрясение на глубине 20 километров 52°18′ с. ш. 161°00′ в. д.HGЯO произошло 4 ноября в 04:58 по местному времени и, по разным данным, имело мощность от 8,5 до 9,0 магнитуд. Высота волны цунами достигала 18 метров у побережья Камчатки и Курильских островов, полностью был уничтожен город Северо-Курильск, погибло несколько тысяч людей. Гавайев достигли волны высотой 6—9 метров и нанесли материальный ущерб на сумму от 800 000 до 1 000 000 долларов, однако человеческих жертв в этой части света удалось избежать.",
                    "04.11.1952",
                    "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0a/209_0943_SevKur_heli_View_wiki.jpg/411px-209_0943_SevKur_heli_View_wiki.jpg"
                )
            )
        ),
        Day(
            "2006",
            listOf(
                Event(
                    "Камчатку засыпает вулканическим пеплом",
                    "Камчатский поселок Ключи, который накануне был засыпан пеплом от извергающегося вулкана Безымянный, вновь подвергся пеплопаду. На этот раз виновником стал вулкан Шивелуч. Как сообщил ведущий научный сотрудник Института вулканологии и сейсмологии ДВО РАН Алексей Озеров, Шивелуч активизировался в ночь на вторник.  По его словам, в течение более чем девяти часов сейсмостанции, установленные у подножия вулкана, фиксировали непрерывное вулканическое дрожание. По предварительным данным, у вулкана обрушился купол, а облака пепла выбрасывались на высоту до 10 км над кратером. В настоящее время в ключах в воздухе стоит устойчивый запах серы, а пепел падает непрерывно. Из-за извержения вулкана Безымянный в Ключах в понедельник выпал пепел розового цвета. Теперь же поселок засыпает рыжим пеплом. Ситуацию, по словам ученого, спасает снегопад, который также не прекращается двое суток. «Снег снижает опасное воздействие вулканического пепла», – отметил Озеров. Жителям поселка рекомендовано поменьше находиться на улице, сообщает Interfax.",
                    "26.12.2006",
                    "https://upload.wikimedia.org/wikipedia/commons/4/48/D0807I14-HarbourTour.jpg"
                ),
                Event(
                    "Камчатке грозит девятибальное землетрясение",
                    "В районе Петропавловска-Камчатского в течение ближайших пяти лет возможно землетрясение магнитудой 9 по шкале Рихтера, прогнозируют ученые Института вулканологии Дальневосточного отделения РАН. Об этом заявил во вторник на пресс-конференции в Хабаровске начальник Дальневосточного регионального центра МЧС генерал Виктор Капканщиков. \n\nОценивая прогнозы на 2007 год, генерал подчеркнул, что «предвестников сильных землетрясений на ближайшее время нет, но прогнозируется их вероятность в течение года на Камчатке, Сахалине и Татарском проливе». Во всех субъектах Федерации отработаны планы доставки спасателей, медиков и других специалистов в районы возможных ЧС, эвакуации населения, оказания материальной и финансовой помощи населению в случае землетрясений. По словам генерала, с начала 2006 года на Дальнем Востоке произошло 212 чрезвычайных ситуаций, в результате которых погибли 393 и пострадали 1405 человек. Спасены 1012 человек. По сравнению с аналогичным периодом прошлого года количество ЧС в регионе уменьшилось на 29%, а число погибших – на 25%. Зарегистрировано 745 подземных толчков, или в 3 раза больше, чем в 2005 году.",
                    "26.12.2006",
                    "http://cdn.iz.ru/sites/default/files/styles/900x506/public/news-2020-12/TASS_38557214%204.jpg?itok=s2pfGDXw"
                )
            )
        ),
        Day(
            "2010",
            listOf(
                Event(
                    "Полигон ядохимикатов у вулкана Козельский на Камчатке будет полностью законсервирован в августе",
                    "РИА Новости. Власти Камчатки в рамках краевой программы по обеспечению экологической безопасности региона завершают консервацию полигона ядохимикатов близ вулкана Козельский, в 35 километрах от Петропавловска, сообщил РИА Новости представитель пресс-службы краевого правительства.  \n\nС проведением комплекса природоохранных работ на Козельском полигоне будет обеспечено безопасное хранение 108 тонн ядохимикатов и пестицидов, захороненных с 1979 по 1982 год\" - сказал собеседник агентства.По его словам, полигон уже покрыт специальной влагонепроницаемой пленкой (геомембраной) и слоем грунта. Опасные отходы надежно укрыты от дождя и талого снега, из-за которых ядовитые вещества могли бы попасть в грунтовые воды и водоемы. По специальному водоотводному рву влага теперь будет уходить за пределы полигона, могильник перестанет нести угрозу для окружающей среды.Сейчас на территории могильника идет установка заграждений и прокладка подъездных путей. Полностью завершить консервацию планируется в августе 2010 года. В 2009 году на основные работы по обустройству Козельского полигона захоронения ядохимикатов было затрачено 8,8 миллиона рублей. Средства были выделены из бюджетов Камчатского края и Елизовского муниципального образования. Всего на строительство защитных сооружений Козельского полигона выделено 10,5 миллиона рублей.(",
                    "08.07.2010",
                    "https://s0.rbk.ru/v6_top_pics/media/img/3/04/756019934541043.jpg"
                )
            )
        ),
        Day(
            "2021",
            listOf(
                Event(
                    "Камчатские общественники просят проверить экологическое состояние реки Халактырки",
                    "Общественники обратили внимание на неприятный запах и мутность воды на участке вблизи остановки общественного транспорта «Очистная станция» на маршруте «ТЭЦ 2 – мкр. Долиновка». Еще на одном участке в районе улицы Ракетной, расположенном ниже по течению, запах и мутность также имели место, хотя и в значительно меньшей степени.«Для реки высшей рыбохозяйственной категории такие показатели, мягко говоря, нежелательны. Очевидно, на нее оказывается негативное воздействие. Сейчас важно получить заключения специалистов, а потом, если наши предположения подтвердятся, искать источник загрязнения и заниматься его устранением», – прокомментировала модератор региональной тематической площадки ОНФ «Экология» в Камчатском крае, эколог Татьяна Михайлова. По мнению общественников и экологов, вероятной причиной «цветения» Халактырки могут быть неочищенные стоки расположенных на ней предприятий. В том, что негативное воздействие будет подтверждено лабораторными исследованиями, эксперты не сомневаются. Вопрос только в том, насколько серьезным и необратимым окажется это воздействие.",
                    "13.10.2021",
                    "https://kamchatinfo.com/upload/iblock/bfe/cegq84d4v90qz6naqks7t0zcramgamt5.JPG"
                ),
                Event(
                    "Завершён первый сезон масштабного исследования экосистемы Курильского озера",
                    "Ученые завершили первый сезон масштабного исследования экосистемы Курильского озера, сообщили РАИ «КАМЧАТКА-ИНФОРМ» в Кроноцком заповеднике. «Как мы и предполагали, надёжный гидроакустический метод, годами проверенный на других водоёмах, поначалу отказался работать в новых условиях. Мы визуально наблюдали плотные стаи производителей нерки совсем рядом с судном, на котором установлено оборудование. Однако при приближении лодки скопление расступалось и вновь смыкалось за кормой, аппаратура рыбу не регистрировала. По всей видимости это особенности поведения нерки, которое направлено на избегание хищников и достижение конечной цели – нереста. Большая тень от лодки – сигнал опасности, указывающий на присутствие хищника: медведя или рыбоядной птицы», – рассказал Михаил Малин, научный сотрудник Института биологии внутренних вод им. И. Д. Папанина РАН. \n\nПосле нескольких неудачных попыток учёные, наконец, обнаружили на глубине около 15 метров скопления рыб, которые не избегали лодки и регистрировались аппаратурой. Тогда перед исследователями встал вопрос о видовом составе скоплений. Специалист отметил, что в этом году не все потенциальные зоны нереста по литорали озера оказались заняты нерестовыми гнёздами нерки. Судя по всему, нерестилища в притоках были использованы рыбой более полно. Но это не означает, что количество рыбы, зашедшей в озеро в этом сезоне, не дотягивает до оптимальных значений. Дальнейшая математическая обработка полученных данных позволит сделать более определенные выводы.",
                    "12.10.2021",
                    "https://kamchatinfo.com/upload/iblock/afd/l2xihb1fwvkz0amd2vquhi0wc0knwl3a.jpeg"
                ),
                Event(
                    "На Камчатке единственное стадо диких северных оленей начало возрождаться после извержения вулкана Кизимена",
                    "В Кроноцком заповеднике завершился очередной этап исследования редких парнокопытных - камчатского дикого северного оленя, занесённого в Красную книгу Камчатки. Наблюдатели зарегистрировали много оленят, родившихся в этом году. Ученые говорят, что стадо начало увеличиваться впервые за десять лет после извержения вулкана Кизимен, передает агентство «КАМЧАТКА-ИНФОРМ».  \n\nНа Камчатке группировка из нескольких сотен диких северных оленей (самого крупного подвида в Евразии) сохранилась только в Кроноцком заповеднике. \n\nПосле мощного извержения вулкана Кизимен, которое началось 9 декабря 2010 года и продолжалось в течение трех лет, численность животных начала катастрофически сокращаться. В 2020 году прошли очередные авиационные учёты оленей из Кроноцко-Жупановского стада. С вертолёта были обследованы ключевые зимние пастбища краснокнижных парнокопытных. По научным подсчётам за три года численность диких северных оленей выросла на 20%. В результате визуальных наблюдений и последующих расчётов по многолетней научной методике специалисты определили численность животных в 350 особей – это на 50 оленей больше, чем во время авиаучётов 2017 года. Специалисты предполагают, что численность стада немного больше, но дали ту цифру, в которой уверены на 100%. Во время проведения учётов в прошлом году специалисты также отметили высокую выживаемость телят, родившихся годом ранее. \n\nЗа 10 лет испытаний стихией (извержение вулкана Кизимен, выпадение пепла на традиционные зимние пастбища, восстановление пастбищ) животные смогли выжить и сохранить популяцию, говорят в заповеднике.",
                    "10.11.2021",
                    "https://kamchatinfo.com/upload/iblock/6c1/os4cus7pcjrkqn12uxy35uqcn3yp1a4h.png"
                ),
                Event(
                    "В океане у берегов Камчатки после «красных приливов» исчезли целые группы животных - ученые",
                    "Ученые Камчатского филиала Тихоокеанского института географии ДВО РАН провели исследования водной экосистемы в районах экологической катастрофы 2020 года у берегов Камчатки, передает РАИ «КАМЧАТКА-ИНФОРМ» со ссылкой на институт. \n\nВыполненное в 2021 году с помощью водолазов обследование прибрежных вод Юго-Восточной Камчатки свидетельствует, что в целом на глубинах от 5-6 до 18 м наблюдается сильное обеднение фауны, из состава которой выпали не только отдельные виды, но и целые группы и даже типы животных.\n\n«Практически полностью исчезли губки. Такие крупные и массовые их виды, как Halichondria panicea и Amphilectus digitatus, являлись важным компонентом сообществ на твердых субстратах и местом обитания или питания для многих донных организмов. Поэтому их исчезновение существенно влияет на видовой и количественный состав гидробионтов. Освободившиеся от губок и других обрастателей поверхности камней покрыты розовыми точками молодых корковых кораллиновых водорослей», - сообщили в институте. В конце сентября 2020 местные жители и серферы стали жаловаться на загрязнение акватории в районе Авачинской бухты и Халактырского пляжа. Сообщалось о необычном цвете воды и массовой гибели морских животных, поступали жалобы на першение в горле и ожоги роговицы глаз после купания. \n\nВ качестве одной из приоритетных версий явления ученые называли так называемый красный прилив - опасное явление, вызванное скоплением микроскопических водорослей, выделяющих токсины.",
                    "28.10.2021",
                    "https://kamchatinfo.com/upload/iblock/d69/4xb5ayu1esvyb6e4ppyefrgviy14f0uf.jpg"
                ),
                Event(
                    "Камчатские ученые пересчитают тюленят острова Уташуд по фотографиям",
                    "«Береговое репродуктивное лежбище ларги – уникальное явление, поскольку обычно этот вид тюленей размножается на льду. Именно поэтому щенки появляются на свет в белом наряде, который делает их малозаметными для хищников. На побережье Камчатки есть всего 4 места, где ларга приносит потомство на суше, остров Уташуд – одно из них. Примерно к месячному возрасту бельки линяют и приобретают пятнистую окраску взрослых особей. Считается, что пик рождения детенышей приходится на конец марта – начало апреля. Однако ещё в первой декаде июня мы наблюдали только начавшего линять белька ларги! Также мы отметили антуров с щенками, – рассказала Евгения Волкова, научный сотрудник заповедника, биолог. – Репродуктивный период проходит и у тихоокенских чаек, которые обитают в непосредственной близости к лежбищу тюленей. Особого беспокойства во время краткого визита людей к фоторегистраторам птицы не выказывали и затем вернулись к гнёздам». \n\nВо время пешего патрулирования острова наблюдатели насчитали недалеко от берега более 50 каланов. В их числе отмечены и самки с детёнышами, которых они держат на своём животе, находясь на поверхности воды. Матери кормят каланят и расчёсывают их густой мех, который позволяет сохранять зверям тепло в холодных водах Тихого океана.",
                    "18.06.2021",
                    "https://kamchatinfo.com/upload/iblock/76e/dx0uixhjlykzb8th2x27lmdsk46rlgkv.jpg"
                ),
                Event(
                    "Учёные выяснили, какой вид мусора угрожает морским животным Камчатки",
                    "Топ-10 предметов-загрязнителей по количеству: \n " +
                            "Бутылки пластиковые \n" +
                            "Фрагменты пластика неопознанные \n " +
                            "Крышки от бутылок \n " +
                            "Веревки \n " +
                            "Фрагменты обработанной древесины \n" +
                            "Буи и наплава \n" +
                            "Пленка полиэтиленовая \n" +
                            "Стреппинг лента \n" +
                            "Тара от бытовой химии \n" +
                            "Бутылки стеклянные \n" +
                            "Топ-10 предметов-загрязнителей по массе \n" +
                            "Канаты \n" +
                            "Сети рыболовные \n" +
                            "Фрагменты обработанной древесины \n" +
                            "Веревки \n" +
                            "Бутылки пластиковые \n" +
                            "Бочки от топлива металлические \n" +
                            "Паллеты деревянные \n" +
                            "Буи и наплава \n" +
                            "Ловушки на краба \n" +
                            "Фрагменты пластика неопознанные \n" +
                            "Брендированный мусор \n" +
                            "Южнокорейские бренды – около 50% \n" +
                            "Российские бренды – почти 28% " +
                            "Остальное – американские, японские и бренды других стран. " +
                            "Топ-5 загрязнителей по количеству фрагментов брендированного морского мусора \n" +
                            "스파클 Sparkle – 31% \n" +
                            "ЗАО «Малкинское» – 6,7% \n" +
                            "ГК «Славда» – 6% \n" +
                            "Woosin Trading Co. – 3,5% \n" +
                            "The Coca-Cola Company – 3,4% ",
                    "24.11.2021",
                    "https://kamchatinfo.com/upload/iblock/267/u99oeu71p1saziongku1dvd083exxz97.jpg"
                )
            )
        ),
    )
}